[
    "Rats' super-strong teeth never stop growing.",
    "Rats' whiskers are more sensitive than human fingertips.",
    "Rats can laugh! They make high-pitched noises when they play.",
    "Some rats can swim over a mile.",
    "The Sumatran Bamboo Rat can weigh up to 8.8 pounds.",
    "There are more than 60 species of rat.",
    "Osgood's Vietnamese rat only grows to 5-7 inches long.",
    "The brown and house rat are the most common in the world because they have taken boats to every country over the past few centuries.",
    "Many rat species live in trees.",
    "Most rats are nocturnal.",
    "Male rats are called bucks.",
    "Unmated female rats are called does, mated female rats are called dams.",
    "A group of rats is called a mischief!",
    "The black rat is the species of rat that carried the bubonic plague, killing 75 million people worldwide.",
    "Rat diseases are believed to have taken more human lives in the last 1000 years than all casualties of wars combined.",
    "Each year, rats destroy approximately 20% of all agricultural products in the world.",
    "Some rats can tread water for up to three days.",
    "Rats can survive falls of 50 feet.",
    "If a rat's head fits into a hole, its body can usually follow.",
    "Rats can chew through lead, cinder block, and aluminum sheeting.",
    "Rats cannot go without food for more than 4 days.",
    "Rats can produce 8 to 12 offspring every 30 days.",
    "In the U.S., about 14,000 people report direct attacks from rats. Some of these reports are mortal wounds.",
    "Antartica is the only continent uninhabited by rats.",
    "A kangaroo rat can go its average 10-year life span without any water.",
    "Rats have an incredibly strong sense of smell.",
    "Rats are mammals referred to as rodents because they belong to the scientific order of Rodentia.",
    "When Pixar created the 2007 film Ratatouille, the animators kept rats in their offices to bring their likeness to life with greater accuracy.",
    "Rats have such good sense of smell, they have been used to detect landmines and diagnose diseases such as tuberculosis.",
    "In many countries, rat meat is still a popular culinary option. You can dine on rat in Cambodia, Laos, Myanmar, and parts of the Philippines, Indonesia, Thailand, Ghana, China, and Vietnam.",
    "Karni Mata Temple in India is home to over 25,000 black rats who are worshipped there.",
    "Ancient Romans did not have a word to distinguish rats from mice. Instead they referred to them as big mouse (mus maximus) and little mouse (mus minimus)",
    "There have been a number of fictional rats in popular culture. Some of the most famous include Stuart Little, Remy from Ratatouille, Master Splinter from Teenage Mutant Ninja Turtles, and Chuck E. Cheese (who was changed to a mouse in 1997 for publicity reasons).",
    "There have been a number of fictional rats in popular culture. Some of the most famous include Stuart Little, Remy from Ratatouille, Master Splinter from Teenage Mutant Ninja Turtles, and Chuck E. Cheese (who was changed to a mouse in 1997 for publicity reasons).",
    "The fancy rat, also known as rattus norvegicus domestica, is the most common rat kept as a pet. It is a domesticated relative of the Norway rat ",
    "Rats can lift almost 1 pound which is more than their average body weight.",
    "Some of the first animals sent to space were rats launched in 1961 from France.",
    "Rats have great memories and can memorize a route after learning to navigate it once.",
    "Rats’ jaws are built like an alligator and can exert as much as 7000 pounds per square inch.",
    "Victorian rat catcher Jack Black is loosely credited with the domestication of rats and introducing the fancy rat, which even Queen Victoria herself kept as pets.",
    "Ancient Romans believed a white rat crossing your path was good luck, and a black rat was a bad omen.",
    "Rats' tails help them balance and communicate with each other, and also help regulate body temperature.",
    "Rats don't have tonsils or gallbladders, but they do have belly buttons.",
    "Rats don't sweat, but they regulate their temperature by constricting or expanding blood vessels in their tails.",
    "The tooth enamel of rats is said to be stronger than steel.",
    "A group of rats tails can become entangled and caught in substances such as tree sap or gum, making them unable to escape. This terrifying phenomenon is known as a rat king.",
    "Rats have been known to restart their heart after electric shock.",
    "Rats are color blind and have very poor eyesight.",
    "Evidence suggests that Egyptian birds preyed upon Mediterranean rats.",
    "Small rats can fit through a hole 0.96 inches in diameter -- the size of a quarter.",
    "The Canadian province of Alberta (population 4.25 million) is the largest inhabited area known to be completely free of rats.",
    "The rat is the first of the 12 years of the Chinese Zodiac. 2020 is the return of the year of the rat!",
    "Rattus are not the only genus where animals considered to be rats can be found. Other genera include Neotoma, Bandicota, and Dipodomys.",
    "Rats are capable of playing hide-and-seek.",
    "Rat torture was a cruel method of interrogation used by many South American dictatorships in the 20th century.",
    "Rats can jump 2 feet in the air from a standing position and add an additional foot with a running start.",
    "The royal rat catcher of Queen Victoria gave an albino rat to Beatrix Potter, the author of the much loved Peter Rabbit series.",
    "The maturity of rats can be shown by their yellow teeth. Baby rats initially have white teeth.",
    "Rats are of the few species of rodent that maintain a sophisticated social structure complete with leaders, assistant leaders, outcasts and rebels.",
    "Mice will investigate new things with interest, but rats are what is known as neophobic, meaning they are afraid of trying new things.",
    "Rats have great hearing and can communicate by producing and recognizing meaningful ultrasound frequencies that humans can't hear.",
    "The Florida Panthers of the NHL have a tradition called \"rat-trick\" where fans throw thousands of plastic rats on the ice during the playoffs.",
    "Rats teeth never stop growing. Their front teeth grow 4.5 to 5.5 inches every year.",
    "The old Jameson Whiskey distillery in Dublin included a milk budget for the cats used to keep rats out of the barley warehouse.",
    "The earliest known record of the Pied Piper comes from the town of Hamelin itself. A stained glass window in a church dates to around 1300, although the church was destroyed in the early 17th century.",
    "Rats can scale brick or cement walls with ease, due to the long claws on their feet.",
    "Rats are very clean animals -- even cleaner than cats!",
    "Rats can be trained to do several tricks and they will also learn their name.",
    "A rat known as \"Ratty\" was a main character in the popular children's novel, Wind in the Willows, published in 1908.",
    "Rats are masters of communication. Like humans they can communicate through body language, touch, smell, and sound.",
    "The Staten Island Yankees held a naming contest in 2016. \"Pizza Rats\" was one of the final names in response to the viral sensation \"Pizza Rat\". Every year they suspend their Yankees moniker for a number of games and take the field as the Staten Island Pizza Rats.",
    "Rats learn what food that they like from smelling the breath of other rats.",
    "Rats take care of injured and sick members of their group.",
    "Without companionship, rats tend to get lonely and depressed.",
    "Rats give in to peer-pressure just like humans. The urge to conform is so strong they will choose to eat unpalatable food if they're with other rats eating it.",
    "Rats ate an estimated 10% of Pablo Escobar's money every year, amounting to $2.1 billion.",
    "Rats use their whiskers in the dark to determine an objects size, shape, orientation and texture. This is called \"whisking.\"",
    "Scientists have identified that rats have dreams.",
    "Rat tastebuds are sensitive enough to detect a teaspoon of chocolate in 1302 gallons of milk.",
    "Life span varies between species, but the average lifespan of a rat in the wild is one year due to predators.",
    "Rats have flourished as invasive species on isolated islands where they prey on the eggs and young of forest birds that never evolved defenses against them.",
    "About 12 rats per year enter Alberta, Canada. All of which are quickly eliminated by their specialized Rat Control Task Force.",
    "Rats experience regret just like humans. 😔",
    "Blue dye in M&Ms has been found to reduce spinal injury in rats. Although the levels required had the unfortunate side effect of turning the rats blue.",
    "In 1954, the rat problem in Bombay, India was so bad they began accepting dead rats in place of taxes. People quickly exploited the system with mass breeding and killing projects causing the program to be terminated.",
    "Rats will sometimes grind their teeth from stress or pain, but this bahavior typically is to express contentment and relaxation. The behavior is known as bruxing.",
    "Like hamsters stuffing their cheeks, rats hoard food to save for later. This contributes to non-target poisoning when they remove poison bait and transport it to their stash.",
    "Rats are born with their eyes closed and are helpless without parental care. Their eyes open between 12 and 17 days after birth and they are independent by 21 days.",
    "Rats have an excellent sense of taste and will frequently test new foods to see if it will make them sick or if they can digest it properly.",
    "Not all species of rats enjoy living in close proximity to humans, some seek out remote areas. The largest rat species, found deep in the Papua New Guinea jungle, wasn't discovered until 2009!",
    "Rats spelled backwards is star.",
    "Rats are omnivores, but many prefer meat when they can get it.",
    "Just like cats and dogs, rats have unique personality traits.",
    "Some major pet store chains will carry rats for around $14 each.",
    "Rats were used in research for the first time more than 200 years ago to understand human physiology and medicine.",
    "Mazes to test rat intelligence were 1st built a century ago.",
    "30 Nobel Prize research projects used rats.",
    "According to a study, the favourite foods of city-dwelling rats include scrambled eggs, macaroni and cheese and cooked corn.",
    "There’s a monument to lab rats and mice in Russia.",
    "Rats can’t vomit or burp and they rarely get heart burn.",
    "There is an emoji for rats! 🐀"
]
